<details ><summary>plan for staging 2025-04-03 07:56:03 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project kahnwong/digger-demo#staging has been locked by PR #4
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 40
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + random_string = (known after apply)

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (staging)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |        RESOURCE        |
|--------|------------------------|
| add    | `random_string.random` |

| CHANGE |     OUTPUT      |
|--------|-----------------|
| add    | `random_string` |

</details>

</details>